<details ><summary>apply for production-pce 2025-11-11 04:06:31 (UTC)</summary>
  <details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # aws_s3_bucket.example_bucket will be created
  + resource "aws_s3_bucket" "example_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "unique-sample-bucket-terraform-111125"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Dev"
          + "Name"        = "ExampleBucket"
        }
      + tags_all                    = {
          + "Environment" = "Dev"
          + "Name"        = "ExampleBucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_s3_bucket.example_bucket: Creating...
aws_s3_bucket.example_bucket: Still creating... [10s elapsed]
aws_s3_bucket.example_bucket: Creation complete after 16s [id=unique-sample-bucket-terraform-111125]

Warning: Argument is deprecated

  with aws_s3_bucket.example_bucket,
  on main.tf line 21, in resource "aws_s3_bucket" "example_bucket":
  21:   acl    = "private"

Use the aws_s3_bucket_acl resource instead

(and 2 more similar warnings elsewhere)

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```
</details>
</details>